classes/programming-201-intermediate-python/index.org
* Programming 201: Intermediate Python             :30:minutes:welcome:setup:

  Welcome to *NSL 3.0's* class *Programming 201: Intermediate Python* where you, the aspiring Python Hacker will watch, learn, and do in your quest to create.

  This is an intermediate level exploration immediately following our beginner level *Programming 101: Introduction to Python*.

  Hopefully you at least have:

    - [[http://python.org/download/][Python]] *version 3* available to you
    - [[https://virtualenv.pypa.io][virtualenv]] installed with your operating system or [[https://pip.pypa.io/en/stable/installing/][pip]]
    - An [[https://docs.python.org/3/library/idle.html][IDE]] or [[https://www.gnu.org/software/emacs/][editor]] of [[http://www.vim.org/][some]] [[https://www.sublimetext.com/][kind]] for editing python files

  This class is interactive and you should feel free to follow along in your own environments and ask questions whenever you need -- others probably have the same questions, so be brave!

** How to virtualenv                                             :10:minutes:

   On most systems once you have =virtualenv= installed you can create a new environment with Python 3 like so:

   #+CAPTION: Creating a virtualenv in a Unix shell
   #+BEGIN_EXAMPLE
   $ virtualenv -p python3 env
   Already using interpreter /usr/bin/python3
   Using base prefix '/usr'
   New python executable in env/bin/python3
   Also creating executable in env/bin/python
   Installing setuptools, pkg_resources, pip, wheel...done.
   #+END_EXAMPLE

   On windows you should use =py -m virtualenv -p python3 env=.

   Virtual environment activation is done by executing a script called activate.
   There are several versions to support several different shells.
   Most commonly you will use one of the following methods:

   #+CAPTION: Activating a virtual environment on Unix with zsh, bash, or dash
   #+BEGIN_EXAMPLE
   $ source env/bin/activate
   #+END_EXAMPLE

   #+CAPTION: Activating a virtual environment on Unix with a classic shell
   #+BEGIN_EXAMPLE
   $ . env/bin/activate
   #+END_EXAMPLE

   #+CAPTION: Activating a virtual environment on windows
   #+BEGIN_EXAMPLE
   PS> env\Scripts\activate
   #+END_EXAMPLE

   Simply close your terminal or use the command =deactivate= to break out of an activated virtual environment.

