classes/programming-201-intermediate-python/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-16 Fri 11:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="merlin" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org197b36c">1. Programming 201: Intermediate Python&#xa0;&#xa0;&#xa0;<span class="tag"><span class="30">30</span>&#xa0;<span class="minutes">minutes</span>&#xa0;<span class="welcome">welcome</span>&#xa0;<span class="setup">setup</span></span></a>
<ul>
<li><a href="#orgb47d8b0">1.1. How to virtualenv&#xa0;&#xa0;&#xa0;<span class="tag"><span class="10">10</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#org6e2a433">1.2. How to jupyter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="10">10</span>&#xa0;<span class="minutes">minutes</span></span></a>
<ul>
<li><a href="#orga70b4ec">1.2.1. Makefile&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bonus">bonus</span></span></a></li>
</ul>
</li>
<li><a href="#org3852b9e">1.3. Further resources&#xa0;&#xa0;&#xa0;<span class="tag"><span class="10">10</span>&#xa0;<span class="minutes">minutes</span></span></a>
<ul>
<li><a href="#orga54f8e5">1.3.1. pip User Guide</a></li>
<li><a href="#orga9834f8">1.3.2. virtualenv User Guide</a></li>
<li><a href="#org990c917">1.3.3. Python 3 Documentation: Tutorial</a></li>
<li><a href="#orgcd2d12b">1.3.4. Python 3 Documentation: IDLE</a></li>
<li><a href="#org8dcb039">1.3.5. Python course at Codecademy</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8285ccc">2. Reviewing Programming 101: Introduction to Python&#xa0;&#xa0;&#xa0;<span class="tag"><span class="60">60</span>&#xa0;<span class="minutes">minutes</span>&#xa0;<span class="review">review</span></span></a>
<ul>
<li><a href="#orgb987424">2.1. Why Python is BALLER&#xa0;&#xa0;&#xa0;<span class="tag"><span class="5">5</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#orgc8b0188">2.2. Types, variables, operators, conditionals, loops, and functions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="55">55</span>&#xa0;<span class="minutes">minutes</span></span></a>
<ul>
<li><a href="#org7f36a6b">2.2.1. Types&#xa0;&#xa0;&#xa0;<span class="tag"><span class="7">7</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#org0adae53">2.2.2. Variables&#xa0;&#xa0;&#xa0;<span class="tag"><span class="7">7</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#org69b17ec">2.2.3. Operators&#xa0;&#xa0;&#xa0;<span class="tag"><span class="7">7</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#org68dd46b">2.2.4. Conditionals&#xa0;&#xa0;&#xa0;<span class="tag"><span class="7">7</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#orge1cbd25">2.2.5. Loops&#xa0;&#xa0;&#xa0;<span class="tag"><span class="7">7</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#orgd9dbe2f">2.2.6. Functions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="7">7</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0a8722c">3. Intermediate Python&#xa0;&#xa0;&#xa0;<span class="tag"><span class="45">45</span>&#xa0;<span class="minutes">minutes</span></span></a>
<ul>
<li><a href="#org9789761">3.1. Functions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#orgab40593">3.2. Classes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#org2e82d92">3.3. Generators&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#orge18f293">3.4. Comprehensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#orgf3a9372">3.5. Modules and Packages&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
</ul>
</li>
<li><a href="#orgb33aefb">4. Intermission&#xa0;&#xa0;&#xa0;<span class="tag"><span class="15">15</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#orgadbfaa5">5. Standard Python&#xa0;&#xa0;&#xa0;<span class="tag"><span class="90">90</span>&#xa0;<span class="minutes">minutes</span></span></a>
<ul>
<li><a href="#org49e492c">5.1. Functions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="60">60</span>&#xa0;<span class="minutes">minutes</span></span></a>
<ul>
<li><a href="#org1c9f0bd">5.1.1. Numeric&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#org6f98a39">5.1.2. Logicical Predicates&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#orgad3eb1b">5.1.3. Functional and Iterable&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#org5835272">5.1.4. Types and Objects&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#orga1007e1">5.1.5. Language Primitives&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
</ul>
</li>
<li><a href="#orge9152c2">5.2. Libraries&#xa0;&#xa0;&#xa0;<span class="tag"><span class="30">30</span>&#xa0;<span class="minutes">minutes</span></span></a>
<ul>
<li><a href="#orgbace4d5">5.2.1. sys&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#org8c47282">5.2.2. os&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#org4d0acb2">5.2.3. random&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#org22499a4">5.2.4. collections&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#org1259ef5">5.2.5. itertools&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#org47962ac">5.2.6. json&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
<li><a href="#org2690dc5">5.2.7. functools&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span>&#xa0;<span class="minutes">minutes</span></span></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org197b36c" class="outline-2">
<h2 id="org197b36c"><span class="section-number-2">1</span> Programming 201: Intermediate Python&#xa0;&#xa0;&#xa0;<span class="tag"><span class="30">30</span>&#xa0;<span class="minutes">minutes</span>&#xa0;<span class="welcome">welcome</span>&#xa0;<span class="setup">setup</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
Welcome to <b>NSL 3.0's</b> class <b>Programming 201: Intermediate Python</b> where you, the aspiring Python Hacker will watch, learn, and do in your quest to create.
</p>

<p>
This is an intermediate level exploration immediately following our beginner level <b>Programming 101: Introduction to Python</b>.
</p>

<p>
Hopefully you at least have:
</p>

<ul class="org-ul">
<li><a href="http://python.org/download/">Python</a> <b>version 3</b> available to you</li>
<li><a href="https://virtualenv.pypa.io/">virtualenv</a> installed with your operating system or <a href="https://pip.pypa.io/en/stable/installing/">pip</a></li>
<li>An <a href="https://docs.python.org/3/library/idle.html">IDE</a> or <a href="https://www.gnu.org/software/emacs/">editor</a> of <a href="http://www.vim.org/">some</a> <a href="https://www.sublimetext.com/">kind</a> for editing python files</li>
</ul>

<p>
This class is interactive and you should feel free to follow along in your own environments and ask questions whenever you need &#x2013; others probably have the same questions, so be brave!
</p>
</div>

<div id="outline-container-orgb47d8b0" class="outline-3">
<h3 id="orgb47d8b0"><span class="section-number-3">1.1</span> How to virtualenv&#xa0;&#xa0;&#xa0;<span class="tag"><span class="10">10</span>&#xa0;<span class="minutes">minutes</span></span></h3>
<div class="outline-text-3" id="text-1-1">
<p>
On most systems once you have <code>virtualenv</code> installed you can create a new environment with Python 3 like so:
</p>

<pre class="example">
   $ virtualenv -p python3 env
   Already using interpreter /usr/bin/python3
   Using base prefix '/usr'
   New python executable in env/bin/python3
   Also creating executable in env/bin/python
   Installing setuptools, pkg_resources, pip, wheel...done.
</pre>

<p>
On windows you should use <code>py -m virtualenv -p python3 env</code>.
</p>

<p>
Virtual environment activation is done by executing a script called activate.
There are several versions to support several different shells.
Most commonly you will use one of the following methods:
</p>

<pre class="example">
   $ source env/bin/activate
</pre>

<pre class="example">
   $ . env/bin/activate
</pre>

<pre class="example">
   PS&gt; env\Scripts\activate
</pre>

<p>
Simply close your terminal or use the command <code>deactivate</code> to break out of an activated virtual environment.
</p>
</div>
</div>
