classes/programming-201-intermediate-python/index.org
** How to jupyter                                                :10:minutes:

   Once you have an activated virtual environment, you can use =pip= to install =jupyter=.

   #+CAPTION: Installing jupyter with pip in Unix evironments
   #+BEGIN_EXAMPLE
   $ pip install jupyter
   #+END_EXAMPLE

   #+CAPTION: Installing jupyter with pip in Windows environments
   #+BEGIN_EXAMPLE
   PS> py -m pip install jupyter
   #+END_EXAMPLE

   #+CAPTION: Some of the output when pip installing jupyter
   #+BEGIN_EXAMPLE
Collecting jupyter
  Downloading jupyter-1.0.0-py2.py3-none-any.whl
Collecting jupyter-console (from jupyter)
  Downloading jupyter_console-5.2.0-py2.py3-none-any.whl
Collecting ipywidgets (from jupyter)
  Downloading ipywidgets-7.1.1-py2.py3-none-any.whl (68kB)
    100% |████████████████████████████████| 71kB 706kB/s
Collecting qtconsole (from jupyter)
  Downloading qtconsole-4.3.1-py2.py3-none-any.whl (108kB)
    100% |████████████████████████████████| 112kB 1.1MB/s
Collecting ipykernel (from jupyter)
  Downloading ipykernel-4.8.0-py3-none-any.whl (108kB)
    100% |████████████████████████████████| 112kB 982kB/s
Collecting nbconvert (from jupyter)
  Downloading nbconvert-5.3.1-py2.py3-none-any.whl (387kB)
    100% |████████████████████████████████| 389kB 728kB/s
Collecting notebook (from jupyter)
  Downloading notebook-5.4.0-py2.py3-none-any.whl (8.0MB)
    100% |████████████████████████████████| 8.0MB 84kB/s
Collecting jupyter-client (from jupyter-console->jupyter)
  Downloading jupyter_client-5.2.2-py2.py3-none-any.whl (88kB)
    100% |████████████████████████████████| 92kB 1.2MB/s
Collecting ipython (from jupyter-console->jupyter)
  Using cached ipython-6.2.1-py3-none-any.whl
Collecting prompt-toolkit<2.0.0,>=1.0.0 (from jupyter-console->jupyter)
  Using cached prompt_toolkit-1.0.15-py3-none-any.whl
Collecting pygments (from jupyter-console->jupyter)
  Using cached Pygments-2.2.0-py2.py3-none-any.whl
...
Successfully built tornado pandocfilters
Installing collected packages: six, ipython-genutils, decorator, traitlets, tornado, jupyter-core, python-dateutil, pyzmq, jupyter-client, pickleshare, simplegeneric, pygments, ptyprocess, pexpect, wcwidth, prompt-toolkit, parso, jedi, ipython, ipykernel, jupyter-console, Send2Trash, terminado, MarkupSafe, jinja2, jsonschema, nbformat, testpath, pandocfilters, webencodings, html5lib, bleach, entrypoints, mistune, nbconvert, notebook, widgetsnbextension, ipywidgets, qtconsole, jupyter
Successfully installed MarkupSafe-1.0 Send2Trash-1.4.2 bleach-2.1.2 decorator-4.2.1 entrypoints-0.2.3 html5lib-1.0.1 ipykernel-4.8.0 ipython-6.2.1 ipython-genutils-0.2.0 ipywidgets-7.1.1 jedi-0.11.1 jinja2-2.10 jsonschema-2.6.0 jupyter-1.0.0 jupyter-client-5.2.2 jupyter-console-5.2.0 jupyter-core-4.4.0 mistune-0.8.3 nbconvert-5.3.1 nbformat-4.4.0 notebook-5.4.0 pandocfilters-1.4.2 parso-0.1.1 pexpect-4.3.1 pickleshare-0.7.4 prompt-toolkit-1.0.15 ptyprocess-0.5.2 pygments-2.2.0 python-dateutil-2.6.1 pyzmq-16.0.4 qtconsole-4.3.1 simplegeneric-0.8.1 six-1.11.0 terminado-0.8.1 testpath-0.3.1 tornado-4.5.3 traitlets-4.3.2 wcwidth-0.1.7 webencodings-0.5.1 widgetsnbextension-3.1.3
   #+END_EXAMPLE

   Now run =jupyter notebook= to start the notebook server and open a browser to [[http://localhost:8888/tree]].

   Alternatively, you can run =jupyter console= for a console notebook experience.

   Finally, just use =ipython= if you just want an enhanced python shell but don't need to store your inputs and outputs.

   Easy as *Pie-thon*!

*** Makefile :bonus:

    This repository comes with a top-level Makefile that will create a top-level environment and install all the packages used in these lessons.

    - init :: Target to initialize an environment by creating it and installing requirements in it
    - env :: Target to create environment if not already created
    - requirements :: Target to activate if necessary and install the requirements.txt packages into the environment
    - jupyter-start :: Target to start a jupyter notebook in =JUPYTER_PATH=
    - jupyter-publish :: Target to publish =JUPYTER_PATH='s notebooks into HTML files

    Unfortunately, this will not work on Windows, generally and historically.
   
** Further resources                                             :10:minutes:
*** [[https://pip.pypa.io/en/stable/user_guide/][pip User Guide]]
*** [[https://virtualenv.pypa.io/en/stable/userguide/][virtualenv User Guide]]
*** [[http://docs.python.org/3/tutorial/][Python 3 Documentation: Tutorial]]
*** [[https://docs.python.org/3/library/idle.html][Python 3 Documentation: IDLE]]
*** [[http://www.codecademy.com/tracks/python][Python course at Codecademy]]
* Reviewing Programming 101: Introduction to Python       :60:minutes:review:
** Why Python is BALLER :5:minutes:

   - Easy to Learn and Use :: =Writeability=, =Readability=, and =Discoverability=
   - Easy to Prototype :: =Recyclability=, =Lingua Franca=
   - Easy to Deploy :: =Embedability=, =Portability=, and =Packagability=

   [[https://xkcd.com/353/][Artist rendering of Why Python is BALLER]]

** Types, variables, operators, conditionals, loops, and functions :55:minutes:
*** Types :7:minutes:

    - Types :: *abstract* descriptions of the *state* and *behavior* of an idealized =class= of =objects= (mostly compile-time)
    - Objects :: *concrete* instances of a type of =class= (always run-time)
    - hacker :: A =class=
    - you :: An =object= or instance of =class hacker=
    - me :: A different =object= or instance of =class hacker=

*** Variables :7:minutes:

    - Variables :: Valid [[https://docs.python.org/3/reference/lexical_analysis.html#identifiers][identifier]] named *values* of particular *objects*
    - you, me :: Variables, of course!

