classes/programming-201-intermediate-python/index.html

<div id="outline-container-org6e2a433" class="outline-3">
<h3 id="org6e2a433"><span class="section-number-3">1.2</span> How to jupyter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="10">10</span>&#xa0;<span class="minutes">minutes</span></span></h3>
<div class="outline-text-3" id="text-1-2">
<p>
Once you have an activated virtual environment, you can use <code>pip</code> to install <code>jupyter</code>.
</p>

<pre class="example">
   $ pip install jupyter
</pre>

<pre class="example">
   PS&gt; py -m pip install jupyter
</pre>

<pre class="example">
Collecting jupyter
  Downloading jupyter-1.0.0-py2.py3-none-any.whl
Collecting jupyter-console (from jupyter)
  Downloading jupyter_console-5.2.0-py2.py3-none-any.whl
Collecting ipywidgets (from jupyter)
  Downloading ipywidgets-7.1.1-py2.py3-none-any.whl (68kB)
    100% |████████████████████████████████| 71kB 706kB/s
Collecting qtconsole (from jupyter)
  Downloading qtconsole-4.3.1-py2.py3-none-any.whl (108kB)
    100% |████████████████████████████████| 112kB 1.1MB/s
Collecting ipykernel (from jupyter)
  Downloading ipykernel-4.8.0-py3-none-any.whl (108kB)
    100% |████████████████████████████████| 112kB 982kB/s
Collecting nbconvert (from jupyter)
  Downloading nbconvert-5.3.1-py2.py3-none-any.whl (387kB)
    100% |████████████████████████████████| 389kB 728kB/s
Collecting notebook (from jupyter)
  Downloading notebook-5.4.0-py2.py3-none-any.whl (8.0MB)
    100% |████████████████████████████████| 8.0MB 84kB/s
Collecting jupyter-client (from jupyter-console-&gt;jupyter)
  Downloading jupyter_client-5.2.2-py2.py3-none-any.whl (88kB)
    100% |████████████████████████████████| 92kB 1.2MB/s
Collecting ipython (from jupyter-console-&gt;jupyter)
  Using cached ipython-6.2.1-py3-none-any.whl
Collecting prompt-toolkit&lt;2.0.0,&gt;=1.0.0 (from jupyter-console-&gt;jupyter)
  Using cached prompt_toolkit-1.0.15-py3-none-any.whl
Collecting pygments (from jupyter-console-&gt;jupyter)
  Using cached Pygments-2.2.0-py2.py3-none-any.whl
...
Successfully built tornado pandocfilters
Installing collected packages: six, ipython-genutils, decorator, traitlets, tornado, jupyter-core, python-dateutil, pyzmq, jupyter-client, pickleshare, simplegeneric, pygments, ptyprocess, pexpect, wcwidth, prompt-toolkit, parso, jedi, ipython, ipykernel, jupyter-console, Send2Trash, terminado, MarkupSafe, jinja2, jsonschema, nbformat, testpath, pandocfilters, webencodings, html5lib, bleach, entrypoints, mistune, nbconvert, notebook, widgetsnbextension, ipywidgets, qtconsole, jupyter
Successfully installed MarkupSafe-1.0 Send2Trash-1.4.2 bleach-2.1.2 decorator-4.2.1 entrypoints-0.2.3 html5lib-1.0.1 ipykernel-4.8.0 ipython-6.2.1 ipython-genutils-0.2.0 ipywidgets-7.1.1 jedi-0.11.1 jinja2-2.10 jsonschema-2.6.0 jupyter-1.0.0 jupyter-client-5.2.2 jupyter-console-5.2.0 jupyter-core-4.4.0 mistune-0.8.3 nbconvert-5.3.1 nbformat-4.4.0 notebook-5.4.0 pandocfilters-1.4.2 parso-0.1.1 pexpect-4.3.1 pickleshare-0.7.4 prompt-toolkit-1.0.15 ptyprocess-0.5.2 pygments-2.2.0 python-dateutil-2.6.1 pyzmq-16.0.4 qtconsole-4.3.1 simplegeneric-0.8.1 six-1.11.0 terminado-0.8.1 testpath-0.3.1 tornado-4.5.3 traitlets-4.3.2 wcwidth-0.1.7 webencodings-0.5.1 widgetsnbextension-3.1.3
</pre>

<p>
Now run <code>jupyter notebook</code> to start the notebook server and open a browser to <a href="http://localhost:8888/tree">http://localhost:8888/tree</a>.
</p>

<p>
Alternatively, you can run <code>jupyter console</code> for a console notebook experience.
</p>

<p>
Finally, just use <code>ipython</code> if you just want an enhanced python shell but don't need to store your inputs and outputs.
</p>

<p>
Easy as <b>Pie-thon</b>!
</p>
</div>

<div id="outline-container-orga70b4ec" class="outline-4">
<h4 id="orga70b4ec"><span class="section-number-4">1.2.1</span> Makefile&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bonus">bonus</span></span></h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
This repository comes with a top-level Makefile that will create a top-level environment and install all the packages used in these lessons.
</p>

<dl class="org-dl">
<dt>init</dt><dd>Target to initialize an environment by creating it and installing requirements in it</dd>
<dt>env</dt><dd>Target to create environment if not already created</dd>
<dt>requirements</dt><dd>Target to activate if necessary and install the requirements.txt packages into the environment</dd>
<dt>jupyter-start</dt><dd>Target to start a jupyter notebook in <code>JUPYTER_PATH</code></dd>
<dt>jupyter-publish</dt><dd>Target to publish <code>JUPYTER_PATH</code>'s notebooks into HTML files</dd>
</dl>

<p>
Unfortunately, this will not work on Windows, generally and historically.
</p>
</div>
</div>
</div>

<div id="outline-container-org3852b9e" class="outline-3">
<h3 id="org3852b9e"><span class="section-number-3">1.3</span> Further resources&#xa0;&#xa0;&#xa0;<span class="tag"><span class="10">10</span>&#xa0;<span class="minutes">minutes</span></span></h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-orga54f8e5" class="outline-4">
<h4 id="orga54f8e5"><span class="section-number-4">1.3.1</span> <a href="https://pip.pypa.io/en/stable/user_guide/">pip User Guide</a></h4>
</div>
<div id="outline-container-orga9834f8" class="outline-4">
<h4 id="orga9834f8"><span class="section-number-4">1.3.2</span> <a href="https://virtualenv.pypa.io/en/stable/userguide/">virtualenv User Guide</a></h4>
</div>
<div id="outline-container-org990c917" class="outline-4">
<h4 id="org990c917"><span class="section-number-4">1.3.3</span> <a href="http://docs.python.org/3/tutorial/">Python 3 Documentation: Tutorial</a></h4>
</div>
<div id="outline-container-orgcd2d12b" class="outline-4">
<h4 id="orgcd2d12b"><span class="section-number-4">1.3.4</span> <a href="https://docs.python.org/3/library/idle.html">Python 3 Documentation: IDLE</a></h4>
</div>
<div id="outline-container-org8dcb039" class="outline-4">
<h4 id="org8dcb039"><span class="section-number-4">1.3.5</span> <a href="http://www.codecademy.com/tracks/python">Python course at Codecademy</a></h4>
</div>
</div>
</div>
<div id="outline-container-org8285ccc" class="outline-2">
<h2 id="org8285ccc"><span class="section-number-2">2</span> Reviewing Programming 101: Introduction to Python&#xa0;&#xa0;&#xa0;<span class="tag"><span class="60">60</span>&#xa0;<span class="minutes">minutes</span>&#xa0;<span class="review">review</span></span></h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgb987424" class="outline-3">
<h3 id="orgb987424"><span class="section-number-3">2.1</span> Why Python is BALLER&#xa0;&#xa0;&#xa0;<span class="tag"><span class="5">5</span>&#xa0;<span class="minutes">minutes</span></span></h3>
<div class="outline-text-3" id="text-2-1">
<dl class="org-dl">
<dt>Easy to Learn and Use</dt><dd><code>Writeability</code>, <code>Readability</code>, and <code>Discoverability</code></dd>
<dt>Easy to Prototype</dt><dd><code>Recyclability</code>, <code>Lingua Franca</code></dd>
<dt>Easy to Deploy</dt><dd><code>Embedability</code>, <code>Portability</code>, and <code>Packagability</code></dd>
</dl>

<p>
<a href="https://xkcd.com/353/">Artist rendering of Why Python is BALLER</a>
</p>
</div>
</div>

<div id="outline-container-orgc8b0188" class="outline-3">
<h3 id="orgc8b0188"><span class="section-number-3">2.2</span> Types, variables, operators, conditionals, loops, and functions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="55">55</span>&#xa0;<span class="minutes">minutes</span></span></h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-org7f36a6b" class="outline-4">
<h4 id="org7f36a6b"><span class="section-number-4">2.2.1</span> Types&#xa0;&#xa0;&#xa0;<span class="tag"><span class="7">7</span>&#xa0;<span class="minutes">minutes</span></span></h4>
<div class="outline-text-4" id="text-2-2-1">
<dl class="org-dl">
<dt>Types</dt><dd><b>abstract</b> descriptions of the <b>state</b> and <b>behavior</b> of an idealized <code>class</code> of <code>objects</code> (mostly compile-time)</dd>
<dt>Objects</dt><dd><b>concrete</b> instances of a type of <code>class</code> (always run-time)</dd>
<dt>hacker</dt><dd>A <code>class</code></dd>
<dt>you</dt><dd>An <code>object</code> or instance of <code>class hacker</code></dd>
<dt>me</dt><dd>A different <code>object</code> or instance of <code>class hacker</code></dd>
</dl>
</div>
</div>

<div id="outline-container-org0adae53" class="outline-4">
<h4 id="org0adae53"><span class="section-number-4">2.2.2</span> Variables&#xa0;&#xa0;&#xa0;<span class="tag"><span class="7">7</span>&#xa0;<span class="minutes">minutes</span></span></h4>
<div class="outline-text-4" id="text-2-2-2">
<dl class="org-dl">
<dt>Variables</dt><dd>Valid <a href="https://docs.python.org/3/reference/lexical_analysis.html#identifiers">identifier</a> named <b>values</b> of particular <b>objects</b></dd>
<dt>you, me</dt><dd>Variables, of course!</dd>
</dl>
</div>
</div>
