classes/programming-201-intermediate-python/index.org
*** Operators :7:minutes:

    - Operations :: An area of management concerned with designing and controlling the process of production and redesigning business *operations* in the production of goods or services
    - Operations :: Methods of manipulating and inspecting =objects=
    - + :: Addition operator, usually used to *add* things together in some manner
    - . :: Dot operator, used to refer to =class= member attributes
    - =you.age + me.age= :: Your age, plus my age, equals *a meaningless number*

*** Conditionals :7:minutes:

    - Conditionals :: Logical conditions using [[https://en.wikipedia.org/wiki/Boolean_algebra][boolean algebra]] to *branch* code into choices of what to do
    - ~'even' if you.age % 2 == 0 else 'odd'~ :: Find out if you're an *odd* hacker today!

*** Loops :7:minutes:

    - Loops :: Repeating code infinitely or over a sequence of things
    - while True: print('loops repeat things') :: =loops repeat things loops repeat things loops repeat things loops repeat things loops repeat things...=

*** Functions :7:minutes:

    - Functions :: Stored *procedures*, or recipes, of code that can be *invoked* later and *return* some value

* Intermediate Python                                            :45:minutes:
** Functions                                                      :9:minutes:

   - Variadic :: The property of a =function= that can receive a *variable* number of arguments
   - Optional :: Defaults can be set for arguments of a function rendering them *optional*
   - Keyword :: Keyword arguments are the basis of *optional* arguments and are part of variadic arguments

** Classes                                                        :9:minutes:

   - class :: Keyword to define a new =class=
   - __init__ :: Method called when an =object= of a =class= is *instantiated*
   - __str__ :: Method called when an =object= is converted to a string
   - __repr__ :: Method called when the =representation= of an =object= is needed

   See [[https://docs.python.org/3/reference/datamodel.html#basic-customization][Python3 Documentation - Basic Configuration]] for more!

** Generators                                                    :9:minutes:

   - Coroutines :: Special functions for [[https://en.wikipedia.org/wiki/Cooperative_multitasking][cooperative multitasking]]
   - yield :: Keyword to communicate a return value and potentially receive an input value from a *coroutine*

** Comprehensions                                                :9:minutes:

   - Comprehensions :: Special *syntax* that emulates *Mathematics* [[https://en.wikipedia.org/wiki/Set-builder_notation][set-builder notation]]
   - {x | x in S and x even} :: Mathematical set notation describing =the set of values x in set S that are even=
   - Comprehesion Types :: Python supports *comprehensions* for =lists=, =generators=, =dictionaries=, and =sets=

** Modules and Packages                                           :9:minutes:

   - Modules :: Every python file is a *module*
   - Packages :: Any folder with an =__init__.py= is a *package* of *modules*

* Intermission                                                   :15:minutes:

   On the origins of Python, Van Rossum wrote in *1996*:

   #+CAPTION: Nameday story of Python
   #+BEGIN_QUOTE
    ...In December 1989, I was looking for a "hobby" programming project that would keep me occupied during the week around Christmas. My office ... would be closed, but I had a home computer, and not much else on my hands. I decided to write an interpreter for the new scripting language I had been thinking about lately: a descendant of ABC that would appeal to Unix/C hackers. I chose Python as a working title for the project, being in a slightly irreverent mood (and a big fan of Monty Python's Flying Circus).
    — Guido van Rossum
   #+END_QUOTE

   - [[https://www.youtube.com/watch?v=WwIbaYstoPs][A Selection of Sketches from "Monty Python's Flying Circus" - #1]]
   - [[https://www.youtube.com/watch?v=JXfosKV7jIo][A Selection of Sketches from "Monty Python's Flying Circus" - #2]]
   - [[https://www.youtube.com/watch?v=AxheoB6QbDc][A Selection of Sketches from "Monty Python's Flying Circus" - #3]]

* Standard Python                                                :90:minutes:
** Functions                                                     :60:minutes:
   
   The [[https://docs.python.org/3/library/functions.html][Python 3 Documentation: Built-in Functions]] lists *68* functions which we will further break into *5* categories.

