classes/programming-201-intermediate-python/index.html

<div id="outline-container-org69b17ec" class="outline-4">
<h4 id="org69b17ec"><span class="section-number-4">2.2.3</span> Operators&#xa0;&#xa0;&#xa0;<span class="tag"><span class="7">7</span>&#xa0;<span class="minutes">minutes</span></span></h4>
<div class="outline-text-4" id="text-2-2-3">
<dl class="org-dl">
<dt>Operations</dt><dd>An area of management concerned with designing and controlling the process of production and redesigning business <b>operations</b> in the production of goods or services</dd>
<dt>Operations</dt><dd>Methods of manipulating and inspecting <code>objects</code></dd>
<dt>+</dt><dd>Addition operator, usually used to <b>add</b> things together in some manner</dd>
<dt>.</dt><dd>Dot operator, used to refer to <code>class</code> member attributes</dd>
<dt><code>you.age + me.age</code></dt><dd>Your age, plus my age, equals <b>a meaningless number</b></dd>
</dl>
</div>
</div>

<div id="outline-container-org68dd46b" class="outline-4">
<h4 id="org68dd46b"><span class="section-number-4">2.2.4</span> Conditionals&#xa0;&#xa0;&#xa0;<span class="tag"><span class="7">7</span>&#xa0;<span class="minutes">minutes</span></span></h4>
<div class="outline-text-4" id="text-2-2-4">
<dl class="org-dl">
<dt>Conditionals</dt><dd>Logical conditions using <a href="https://en.wikipedia.org/wiki/Boolean_algebra">boolean algebra</a> to <b>branch</b> code into choices of what to do</dd>
<dt><code>'even' if you.age % 2 == 0 else 'odd'</code></dt><dd>Find out if you're an <b>odd</b> hacker today!</dd>
</dl>
</div>
</div>

<div id="outline-container-orge1cbd25" class="outline-4">
<h4 id="orge1cbd25"><span class="section-number-4">2.2.5</span> Loops&#xa0;&#xa0;&#xa0;<span class="tag"><span class="7">7</span>&#xa0;<span class="minutes">minutes</span></span></h4>
<div class="outline-text-4" id="text-2-2-5">
<dl class="org-dl">
<dt>Loops</dt><dd>Repeating code infinitely or over a sequence of things</dd>
<dt>while True: print('loops repeat things')</dt><dd><code>loops repeat things loops repeat things loops repeat things loops repeat things loops repeat things...</code></dd>
</dl>
</div>
</div>

<div id="outline-container-orgd9dbe2f" class="outline-4">
<h4 id="orgd9dbe2f"><span class="section-number-4">2.2.6</span> Functions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="7">7</span>&#xa0;<span class="minutes">minutes</span></span></h4>
<div class="outline-text-4" id="text-2-2-6">
<dl class="org-dl">
<dt>Functions</dt><dd>Stored <b>procedures</b>, or recipes, of code that can be <b>invoked</b> later and <b>return</b> some value</dd>
</dl>
</div>
</div>
</div>
</div>

<div id="outline-container-org0a8722c" class="outline-2">
<h2 id="org0a8722c"><span class="section-number-2">3</span> Intermediate Python&#xa0;&#xa0;&#xa0;<span class="tag"><span class="45">45</span>&#xa0;<span class="minutes">minutes</span></span></h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org9789761" class="outline-3">
<h3 id="org9789761"><span class="section-number-3">3.1</span> Functions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></h3>
<div class="outline-text-3" id="text-3-1">
<dl class="org-dl">
<dt>Variadic</dt><dd>The property of a <code>function</code> that can receive a <b>variable</b> number of arguments</dd>
<dt>Optional</dt><dd>Defaults can be set for arguments of a function rendering them <b>optional</b></dd>
<dt>Keyword</dt><dd>Keyword arguments are the basis of <b>optional</b> arguments and are part of variadic arguments</dd>
</dl>
</div>
</div>

<div id="outline-container-orgab40593" class="outline-3">
<h3 id="orgab40593"><span class="section-number-3">3.2</span> Classes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></h3>
<div class="outline-text-3" id="text-3-2">
<dl class="org-dl">
<dt>class</dt><dd>Keyword to define a new <code>class</code></dd>
<dt>_<sub>init</sub>__</dt><dd>Method called when an <code>object</code> of a <code>class</code> is <b>instantiated</b></dd>
<dt>_<sub>str</sub>__</dt><dd>Method called when an <code>object</code> is converted to a string</dd>
<dt>_<sub>repr</sub>__</dt><dd>Method called when the <code>representation</code> of an <code>object</code> is needed</dd>
</dl>

<p>
See <a href="https://docs.python.org/3/reference/datamodel.html#basic-customization">Python3 Documentation - Basic Configuration</a> for more!
</p>
</div>
</div>

<div id="outline-container-org2e82d92" class="outline-3">
<h3 id="org2e82d92"><span class="section-number-3">3.3</span> Generators&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></h3>
<div class="outline-text-3" id="text-3-3">
<dl class="org-dl">
<dt>Coroutines</dt><dd>Special functions for <a href="https://en.wikipedia.org/wiki/Cooperative_multitasking">cooperative multitasking</a></dd>
<dt>yield</dt><dd>Keyword to communicate a return value and potentially receive an input value from a <b>coroutine</b></dd>
</dl>
</div>
</div>

<div id="outline-container-orge18f293" class="outline-3">
<h3 id="orge18f293"><span class="section-number-3">3.4</span> Comprehensions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></h3>
<div class="outline-text-3" id="text-3-4">
<dl class="org-dl">
<dt>Comprehensions</dt><dd>Special <b>syntax</b> that emulates <b>Mathematics</b> <a href="https://en.wikipedia.org/wiki/Set-builder_notation">set-builder notation</a></dd>
<dt>{x | x in S and x even}</dt><dd>Mathematical set notation describing <code>the set of values x in set S that are even</code></dd>
<dt>Comprehesion Types</dt><dd>Python supports <b>comprehensions</b> for <code>lists</code>, <code>generators</code>, <code>dictionaries</code>, and <code>sets</code></dd>
</dl>
</div>
</div>

<div id="outline-container-orgf3a9372" class="outline-3">
<h3 id="orgf3a9372"><span class="section-number-3">3.5</span> Modules and Packages&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></h3>
<div class="outline-text-3" id="text-3-5">
<dl class="org-dl">
<dt>Modules</dt><dd>Every python file is a <b>module</b></dd>
<dt>Packages</dt><dd>Any folder with an <code>__init__.py</code> is a <b>package</b> of <b>modules</b></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orgb33aefb" class="outline-2">
<h2 id="orgb33aefb"><span class="section-number-2">4</span> Intermission&#xa0;&#xa0;&#xa0;<span class="tag"><span class="15">15</span>&#xa0;<span class="minutes">minutes</span></span></h2>
<div class="outline-text-2" id="text-4">
<p>
On the origins of Python, Van Rossum wrote in <b>1996</b>:
</p>

<blockquote>
<p>
&#x2026;In December 1989, I was looking for a "hobby" programming project that would keep me occupied during the week around Christmas. My office &#x2026; would be closed, but I had a home computer, and not much else on my hands. I decided to write an interpreter for the new scripting language I had been thinking about lately: a descendant of ABC that would appeal to Unix/C hackers. I chose Python as a working title for the project, being in a slightly irreverent mood (and a big fan of Monty Python's Flying Circus).
— Guido van Rossum
</p>
</blockquote>

<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=WwIbaYstoPs">A Selection of Sketches from "Monty Python's Flying Circus" - #1</a></li>
<li><a href="https://www.youtube.com/watch?v=JXfosKV7jIo">A Selection of Sketches from "Monty Python's Flying Circus" - #2</a></li>
<li><a href="https://www.youtube.com/watch?v=AxheoB6QbDc">A Selection of Sketches from "Monty Python's Flying Circus" - #3</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgadbfaa5" class="outline-2">
<h2 id="orgadbfaa5"><span class="section-number-2">5</span> Standard Python&#xa0;&#xa0;&#xa0;<span class="tag"><span class="90">90</span>&#xa0;<span class="minutes">minutes</span></span></h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-org49e492c" class="outline-3">
<h3 id="org49e492c"><span class="section-number-3">5.1</span> Functions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="60">60</span>&#xa0;<span class="minutes">minutes</span></span></h3>
<div class="outline-text-3" id="text-5-1">
<p>
The <a href="https://docs.python.org/3/library/functions.html">Python 3 Documentation: Built-in Functions</a> lists <b>68</b> functions which we will further break into <b>5</b> categories.
</p>
</div>
