classes/programming-201-intermediate-python/index.org
*** Numeric                                                       :9:minutes:

   - abs :: ABSolute value of a number
   - bin :: Convert an =integer= to a string literal =representation= of the value in binary (base 2)
   - complex :: Return a =complex= number with the value =real + (imaginary * 1i)= given a =string= representing a complex number or two =integers=
   - divmod :: Integer divide two non-complex numbers and return a =pair= of the =(quotient, remainder)=
   - float :: Convert an object to a floating point value, including "NaN" and "Infinity"
   - hex :: Convert an integer to a =string= literal =representation= of the value in hexadecimal (base 16)
   - int :: Convert an object to an =integer= value, including =string= literal =representations= in other bases
   - max :: Maximum value of a sequence of numbers
   - min :: Minimum value of a sequence of numbers
   - oct :: Convert an =integer= to a =string= literal =representation= of the value in octal (base 8)
   - round :: Round a floating point number to the nearest =integer= or number of decimal places given
   - pow :: Power of =X to the Y= or power of =X to the Y modulus Z=
   - sum :: Summation of a sequence of numbers

*** Logicical Predicates                                          :9:minutes:

   - all :: Predicate that returns =True= if every value in the given sequence is truthy
   - any :: Predicate that returns =True= if at least one value in the given sequence is truthy
   - callable :: Predicate that returns =True= if the given value is a =callable= function
   - hasattr :: Predicate that returns =True= if the given object has a member attribute with the same name as the given =string=
   - isinstance :: Predicate that returns =True= if the given value is an instance of the given class or classes
   - issubclass :: Predicate that returns =True= if the given value is a subclass or the same class

*** Functional and Iterable                                       :9:minutes:

   - enumerate :: Return an enumerate object given an =iterable= sequence which yields =pairs= of =(index, value)=
   - filter :: Return an =iterator= given an =iterable= whose values return =True= with the given =predicate= function 
   - frozenset :: Return a new immutable =frozenset= optionally with elements taken from an =iterable=
   - iter :: Return an =iterator= from the given object, optionally stopping at some =sentinel= value
   - len :: Return the length of a sequence
   - list :: Return a =list= from the given object
   - map :: Return an =iterator= that applies the given function to every item and yields the results
   - next :: Retrieve the next item from the =iterator= by calling its =__next__= method
   - range :: Return a =range= of numbers which are yielded as needed. [[https://docs.python.org/3/library/stdtypes.html#typesseq-range][Ranges]] are an immutable [[https://docs.python.org/3/library/stdtypes.html#typesseq][sequence type]]
   - reversed :: Return a reverse =iterator= of the given sequence
   - set :: Return a new =set= optionally with elements taken from an =iterable=
   - slice :: Return a =slice= representing the set of indices specified by =range(start, stop, step)
   - sorted :: Return a new sorted list from the given =iterable=
   - tuple :: Return an immutable sequence from the given object
   - zip :: Return an =iterator= that aggregates elements from each given =iterable= into tuples of values for each index

*** Types and Objects                                             :9:minutes:

   - ascii :: Return a =representation= =string= with non-ASCII characters escaped similar to Python 2
   - bool :: Return a =Boolean= value, either =True= or =False= based on the truthiness of the given value.  =bool= is a subclass of =int=.
   - bytearray :: Return a new array of bytes, which is a mutable sequence of =integers= in the range ~0 <= x < 256~
   - bytes :: Return a new =bytes= instance which is an immutable sequence of =integers= in the range ~0 <= x < 256~
   - chr :: Return the =string= representing the Unicode code point of the given =integer=. Inverse of =ord=.
   - classmethod :: Function =decorator= that transforms a =method= into a =class method= invokable from the class rather than object with class variables
   - delattr :: Delete a member attribute of an object given the object and =string= name, if allowed
   - dict :: Create a new =dictionary= mapping object potentially from the given iterable, mapping, and keyword arguments
   - dir :: Return the list of names in current local scope or the list of member attributes for the given value
   - hash :: Return the hash value of the object (if it has one) which is an integer used for dictionary keys
   - memoryview :: Create a [[https://docs.python.org/3/library/stdtypes.html#typememoryview][memoryview]] object from an object that implements the [[https://docs.python.org/3/c-api/buffer.html#bufferobjects][buffer protocol]]
   - object :: Return a new featureless =object=
   - ord :: Return the =integer= representing the Unicode code point given a =string= of a single character. Inverse of =chr=.
   - property :: Return a =property= member attribute, typically used as a =decorator= to create getters and optional setters and deleters
   - repr :: Return a =string= =representation= of the given type, which in most cases should cause the same value to be created if passed to =eval=
   - setattr :: Set a member attribute of an object give the object, =string= name, and value, if allowed
   - staticmethod :: Function =decorator= that transforms a =method= into a =static method= invokable from the class rather than the object
   - str :: Return a new =string= version of the given object
   - super :: Return a proxy object that delegates the method calls to a parent or sibling class of =type= if given or the current class if not
   - type :: Return the =type= of the given object, or, create a new class given =string= name, =tuple= of =string= bases, and a =dictionary= of member attributes

