classes/programming-201-intermediate-python/index.html

<div id="outline-container-org1c9f0bd" class="outline-4">
<h4 id="org1c9f0bd"><span class="section-number-4">5.1.1</span> Numeric&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></h4>
<div class="outline-text-4" id="text-5-1-1">
<dl class="org-dl">
<dt>abs</dt><dd>ABSolute value of a number</dd>
<dt>bin</dt><dd>Convert an <code>integer</code> to a string literal <code>representation</code> of the value in binary (base 2)</dd>
<dt>complex</dt><dd>Return a <code>complex</code> number with the value <code>real + (imaginary * 1i)</code> given a <code>string</code> representing a complex number or two <code>integers</code></dd>
<dt>divmod</dt><dd>Integer divide two non-complex numbers and return a <code>pair</code> of the <code>(quotient, remainder)</code></dd>
<dt>float</dt><dd>Convert an object to a floating point value, including "NaN" and "Infinity"</dd>
<dt>hex</dt><dd>Convert an integer to a <code>string</code> literal <code>representation</code> of the value in hexadecimal (base 16)</dd>
<dt>int</dt><dd>Convert an object to an <code>integer</code> value, including <code>string</code> literal <code>representations</code> in other bases</dd>
<dt>max</dt><dd>Maximum value of a sequence of numbers</dd>
<dt>min</dt><dd>Minimum value of a sequence of numbers</dd>
<dt>oct</dt><dd>Convert an <code>integer</code> to a <code>string</code> literal <code>representation</code> of the value in octal (base 8)</dd>
<dt>round</dt><dd>Round a floating point number to the nearest <code>integer</code> or number of decimal places given</dd>
<dt>pow</dt><dd>Power of <code>X to the Y</code> or power of <code>X to the Y modulus Z</code></dd>
<dt>sum</dt><dd>Summation of a sequence of numbers</dd>
</dl>
</div>
</div>

<div id="outline-container-org6f98a39" class="outline-4">
<h4 id="org6f98a39"><span class="section-number-4">5.1.2</span> Logicical Predicates&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></h4>
<div class="outline-text-4" id="text-5-1-2">
<dl class="org-dl">
<dt>all</dt><dd>Predicate that returns <code>True</code> if every value in the given sequence is truthy</dd>
<dt>any</dt><dd>Predicate that returns <code>True</code> if at least one value in the given sequence is truthy</dd>
<dt>callable</dt><dd>Predicate that returns <code>True</code> if the given value is a <code>callable</code> function</dd>
<dt>hasattr</dt><dd>Predicate that returns <code>True</code> if the given object has a member attribute with the same name as the given <code>string</code></dd>
<dt>isinstance</dt><dd>Predicate that returns <code>True</code> if the given value is an instance of the given class or classes</dd>
<dt>issubclass</dt><dd>Predicate that returns <code>True</code> if the given value is a subclass or the same class</dd>
</dl>
</div>
</div>

<div id="outline-container-orgad3eb1b" class="outline-4">
<h4 id="orgad3eb1b"><span class="section-number-4">5.1.3</span> Functional and Iterable&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></h4>
<div class="outline-text-4" id="text-5-1-3">
<dl class="org-dl">
<dt>enumerate</dt><dd>Return an enumerate object given an <code>iterable</code> sequence which yields <code>pairs</code> of <code>(index, value)</code></dd>
<dt>filter</dt><dd>Return an <code>iterator</code> given an <code>iterable</code> whose values return <code>True</code> with the given <code>predicate</code> function</dd>
<dt>frozenset</dt><dd>Return a new immutable <code>frozenset</code> optionally with elements taken from an <code>iterable</code></dd>
<dt>iter</dt><dd>Return an <code>iterator</code> from the given object, optionally stopping at some <code>sentinel</code> value</dd>
<dt>len</dt><dd>Return the length of a sequence</dd>
<dt>list</dt><dd>Return a <code>list</code> from the given object</dd>
<dt>map</dt><dd>Return an <code>iterator</code> that applies the given function to every item and yields the results</dd>
<dt>next</dt><dd>Retrieve the next item from the <code>iterator</code> by calling its <code>__next__</code> method</dd>
<dt>range</dt><dd>Return a <code>range</code> of numbers which are yielded as needed. <a href="https://docs.python.org/3/library/stdtypes.html#typesseq-range">Ranges</a> are an immutable <a href="https://docs.python.org/3/library/stdtypes.html#typesseq">sequence type</a></dd>
<dt>reversed</dt><dd>Return a reverse <code>iterator</code> of the given sequence</dd>
<dt>set</dt><dd>Return a new <code>set</code> optionally with elements taken from an <code>iterable</code></dd>
<dt>slice</dt><dd>Return a <code>slice</code> representing the set of indices specified by =range(start, stop, step)</dd>
<dt>sorted</dt><dd>Return a new sorted list from the given <code>iterable</code></dd>
<dt>tuple</dt><dd>Return an immutable sequence from the given object</dd>
<dt>zip</dt><dd>Return an <code>iterator</code> that aggregates elements from each given <code>iterable</code> into tuples of values for each index</dd>
</dl>
</div>
</div>

<div id="outline-container-org5835272" class="outline-4">
<h4 id="org5835272"><span class="section-number-4">5.1.4</span> Types and Objects&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></h4>
<div class="outline-text-4" id="text-5-1-4">
<dl class="org-dl">
<dt>ascii</dt><dd>Return a <code>representation</code> <code>string</code> with non-ASCII characters escaped similar to Python 2</dd>
<dt>bool</dt><dd>Return a <code>Boolean</code> value, either <code>True</code> or <code>False</code> based on the truthiness of the given value.  <code>bool</code> is a subclass of <code>int</code>.</dd>
<dt>bytearray</dt><dd>Return a new array of bytes, which is a mutable sequence of <code>integers</code> in the range <code>0 &lt;= x &lt; 256</code></dd>
<dt>bytes</dt><dd>Return a new <code>bytes</code> instance which is an immutable sequence of <code>integers</code> in the range <code>0 &lt;= x &lt; 256</code></dd>
<dt>chr</dt><dd>Return the <code>string</code> representing the Unicode code point of the given <code>integer</code>. Inverse of <code>ord</code>.</dd>
<dt>classmethod</dt><dd>Function <code>decorator</code> that transforms a <code>method</code> into a <code>class method</code> invokable from the class rather than object with class variables</dd>
<dt>delattr</dt><dd>Delete a member attribute of an object given the object and <code>string</code> name, if allowed</dd>
<dt>dict</dt><dd>Create a new <code>dictionary</code> mapping object potentially from the given iterable, mapping, and keyword arguments</dd>
<dt>dir</dt><dd>Return the list of names in current local scope or the list of member attributes for the given value</dd>
<dt>hash</dt><dd>Return the hash value of the object (if it has one) which is an integer used for dictionary keys</dd>
<dt>memoryview</dt><dd>Create a <a href="https://docs.python.org/3/library/stdtypes.html#typememoryview">memoryview</a> object from an object that implements the <a href="https://docs.python.org/3/c-api/buffer.html#bufferobjects">buffer protocol</a></dd>
<dt>object</dt><dd>Return a new featureless <code>object</code></dd>
<dt>ord</dt><dd>Return the <code>integer</code> representing the Unicode code point given a <code>string</code> of a single character. Inverse of <code>chr</code>.</dd>
<dt>property</dt><dd>Return a <code>property</code> member attribute, typically used as a <code>decorator</code> to create getters and optional setters and deleters</dd>
<dt>repr</dt><dd>Return a <code>string</code> <code>representation</code> of the given type, which in most cases should cause the same value to be created if passed to <code>eval</code></dd>
<dt>setattr</dt><dd>Set a member attribute of an object give the object, <code>string</code> name, and value, if allowed</dd>
<dt>staticmethod</dt><dd>Function <code>decorator</code> that transforms a <code>method</code> into a <code>static method</code> invokable from the class rather than the object</dd>
<dt>str</dt><dd>Return a new <code>string</code> version of the given object</dd>
<dt>super</dt><dd>Return a proxy object that delegates the method calls to a parent or sibling class of <code>type</code> if given or the current class if not</dd>
<dt>type</dt><dd>Return the <code>type</code> of the given object, or, create a new class given <code>string</code> name, <code>tuple</code> of <code>string</code> bases, and a <code>dictionary</code> of member attributes</dd>
</dl>
</div>
</div>
