classes/programming-201-intermediate-python/index.org
*** Language Primitives                                           :9:minutes:

   - compile :: Compile the given =string= source code and filename into a =code= or =AST= object
   - eval :: Evaluate the given =string= *expression* or =code= object in the given environment
   - exec :: Execute the given =string= or =code= object in the given environment
   - globals :: Return a dictionary representing the current global symbol table
   - help :: Display documentation strings for the given =object= or =function=
   - id :: Return the identity of an object, which is an =integer= guaranteed to be unique for the object's lifetime
   - input :: Return input from, typically *STDIN*, and output a =string= prompt if given
   - locals :: Return a dictionary representing the current local symbol table
   - open :: Open the file with the given =string= name and optional mode, returning the =file= object
   - print :: Output a =string= to, typically, *STDOUT*
   - vars :: Return the =__dict__= member attribute of the given object
   - __import__ :: The function invoked by the =import= statement which imports a new module (but use =importlib.import_module= instead)

** Libraries                                                     :30:minutes:
*** [[https://docs.python.org/3/library/sys.html][sys]]                                                           :6:minutes:
*** [[https://docs.python.org/3/library/os.html][os]]                                                            :6:minutes:
*** [[https://docs.python.org/3/library/random.html][random]]                                                        :6:minutes:    
*** [[https://docs.python.org/3/library/collections.html][collections]]                                                   :6:minutes:
*** [[https://docs.python.org/3/library/itertools.html][itertools]]                                                     :6:minutes:
*** [[https://docs.python.org/3/library/json.html][json]]                                                          :6:minutes:
*** [[https://docs.python.org/3/library/functools.html][functools]]                                                     :6:minutes:
