classes/programming-201-intermediate-python/index.html

<div id="outline-container-orga1007e1" class="outline-4">
<h4 id="orga1007e1"><span class="section-number-4">5.1.5</span> Language Primitives&#xa0;&#xa0;&#xa0;<span class="tag"><span class="9">9</span>&#xa0;<span class="minutes">minutes</span></span></h4>
<div class="outline-text-4" id="text-5-1-5">
<dl class="org-dl">
<dt>compile</dt><dd>Compile the given <code>string</code> source code and filename into a <code>code</code> or <code>AST</code> object</dd>
<dt>eval</dt><dd>Evaluate the given <code>string</code> <b>expression</b> or <code>code</code> object in the given environment</dd>
<dt>exec</dt><dd>Execute the given <code>string</code> or <code>code</code> object in the given environment</dd>
<dt>globals</dt><dd>Return a dictionary representing the current global symbol table</dd>
<dt>help</dt><dd>Display documentation strings for the given <code>object</code> or <code>function</code></dd>
<dt>id</dt><dd>Return the identity of an object, which is an <code>integer</code> guaranteed to be unique for the object's lifetime</dd>
<dt>input</dt><dd>Return input from, typically <b>STDIN</b>, and output a <code>string</code> prompt if given</dd>
<dt>locals</dt><dd>Return a dictionary representing the current local symbol table</dd>
<dt>open</dt><dd>Open the file with the given <code>string</code> name and optional mode, returning the <code>file</code> object</dd>
<dt>print</dt><dd>Output a <code>string</code> to, typically, <b>STDOUT</b></dd>
<dt>vars</dt><dd>Return the <code>__dict__</code> member attribute of the given object</dd>
<dt>_<sub>import</sub>__</dt><dd>The function invoked by the <code>import</code> statement which imports a new module (but use <code>importlib.import_module</code> instead)</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orge9152c2" class="outline-3">
<h3 id="orge9152c2"><span class="section-number-3">5.2</span> Libraries&#xa0;&#xa0;&#xa0;<span class="tag"><span class="30">30</span>&#xa0;<span class="minutes">minutes</span></span></h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-orgbace4d5" class="outline-4">
<h4 id="orgbace4d5"><span class="section-number-4">5.2.1</span> <a href="https://docs.python.org/3/library/sys.html">sys</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span>&#xa0;<span class="minutes">minutes</span></span></h4>
</div>
<div id="outline-container-org8c47282" class="outline-4">
<h4 id="org8c47282"><span class="section-number-4">5.2.2</span> <a href="https://docs.python.org/3/library/os.html">os</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span>&#xa0;<span class="minutes">minutes</span></span></h4>
</div>
<div id="outline-container-org4d0acb2" class="outline-4">
<h4 id="org4d0acb2"><span class="section-number-4">5.2.3</span> <a href="https://docs.python.org/3/library/random.html">random</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span>&#xa0;<span class="minutes">minutes</span></span></h4>
</div>
<div id="outline-container-org22499a4" class="outline-4">
<h4 id="org22499a4"><span class="section-number-4">5.2.4</span> <a href="https://docs.python.org/3/library/collections.html">collections</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span>&#xa0;<span class="minutes">minutes</span></span></h4>
</div>
<div id="outline-container-org1259ef5" class="outline-4">
<h4 id="org1259ef5"><span class="section-number-4">5.2.5</span> <a href="https://docs.python.org/3/library/itertools.html">itertools</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span>&#xa0;<span class="minutes">minutes</span></span></h4>
</div>
<div id="outline-container-org47962ac" class="outline-4">
<h4 id="org47962ac"><span class="section-number-4">5.2.6</span> <a href="https://docs.python.org/3/library/json.html">json</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span>&#xa0;<span class="minutes">minutes</span></span></h4>
</div>
<div id="outline-container-org2690dc5" class="outline-4">
<h4 id="org2690dc5"><span class="section-number-4">5.2.7</span> <a href="https://docs.python.org/3/library/functools.html">functools</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="6">6</span>&#xa0;<span class="minutes">minutes</span></span></h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: merlin</p>
<p class="date">Created: 2018-02-16 Fri 11:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
